In [55]:
import pandas as pd

In [56]:
path = r"C:\Users\ASUS\Downloads\Students.csv"
print(path)

C:\Users\ASUS\Downloads\Students.csv

In [57]:
df = pd.read_csv(path)

In [58]:
df

   StudentID     Name  Gender  Age  MathScore  EnglishScore  TotalScore
0          1    Alice  Female   15       85.0          90.0         170
1          2      Bob    Male   16        NaN          95.0          95
2          3  Charlie    Male   15       80.0           NaN          80
3          4    Diana  Female   16       90.0          85.0         170
4          5      Eve  Female   15       75.0          70.0         140

In [59]:
df.isna().sum()

StudentID       0
Name            0
Gender          0
Age             0
MathScore       1
EnglishScore    1
TotalScore      0
dtype: int64

# 1 st

In [60]:
df['MathScore'] = df['MathScore'].fillna(df['MathScore'].mean())

In [61]:
df

   StudentID     Name  Gender  Age  MathScore  EnglishScore  TotalScore
0          1    Alice  Female   15       85.0          90.0         170
1          2      Bob    Male   16       82.5          95.0          95
2          3  Charlie    Male   15       80.0           NaN          80
3          4    Diana  Female   16       90.0          85.0         170
4          5      Eve  Female   15       75.0          70.0         140

In [62]:
df['EnglishScore'] = df['EnglishScore'].fillna(df['EnglishScore'].mean())

In [63]:
df

   StudentID     Name  Gender  Age  MathScore  EnglishScore  TotalScore
0          1    Alice  Female   15       85.0          90.0         170
1          2      Bob    Male   16       82.5          95.0          95
2          3  Charlie    Male   15       80.0          85.0          80
3          4    Diana  Female   16       90.0          85.0         170
4          5      Eve  Female   15       75.0          70.0         140

# 2 nd

In [64]:
pip install scikit-learn

Requirement already satisfied: scikit-learn in c:\users\asus\documents\advanced python\repository\venv\lib\site-packages (1.6.0)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy>=1.19.5 in c:\users\asus\documents\advanced python\repository\venv\lib\site-packages (from scikit-learn) (2.2.1)
Requirement already satisfied: scipy>=1.6.0 in c:\users\asus\documents\advanced python\repository\venv\lib\site-packages (from scikit-learn) (1.15.0)
Requirement already satisfied: joblib>=1.2.0 in c:\users\asus\documents\advanced python\repository\venv\lib\site-packages (from scikit-learn) (1.4.2)
Requirement already satisfied: threadpoolctl>=3.1.0 in c:\users\asus\documents\advanced python\repository\venv\lib\site-packages (from scikit-learn) (3.5.0)

In [65]:
df

   StudentID     Name  Gender  Age  MathScore  EnglishScore  TotalScore
0          1    Alice  Female   15       85.0          90.0         170
1          2      Bob    Male   16       82.5          95.0          95
2          3  Charlie    Male   15       80.0          85.0          80
3          4    Diana  Female   16       90.0          85.0         170
4          5      Eve  Female   15       75.0          70.0         140

In [66]:
from sklearn.preprocessing import LabelEncoder


label_encoder = LabelEncoder()         # creating an instance

df['Gender'] = label_encoder.fit_transform(df['Gender'])         # fisrt category as 0 and rest 1 and fit_transform fits 0 and 1 and transforms cat to con

print(df['Gender'])

0    0
1    1
2    1
3    0
4    0
Name: Gender, dtype: int64

In [67]:
df

   StudentID     Name  Gender  Age  MathScore  EnglishScore  TotalScore
0          1    Alice       0   15       85.0          90.0         170
1          2      Bob       1   16       82.5          95.0          95
2          3  Charlie       1   15       80.0          85.0          80
3          4    Diana       0   16       90.0          85.0         170
4          5      Eve       0   15       75.0          70.0         140

# 3 rd

In [68]:
df['TotalScore'] = df['MathScore'] + df['EnglishScore']

In [69]:
df

   StudentID     Name  Gender  Age  MathScore  EnglishScore  TotalScore
0          1    Alice       0   15       85.0          90.0       175.0
1          2      Bob       1   16       82.5          95.0       177.5
2          3  Charlie       1   15       80.0          85.0       165.0
3          4    Diana       0   16       90.0          85.0       175.0
4          5      Eve       0   15       75.0          70.0       145.0

In [70]:
path2 = r"C:\Users\ASUS\Downloads\Sales.csv"
path2

'C:\\Users\\ASUS\\Downloads\\Sales.csv'

In [71]:
df2 = pd.read_csv(path2)

In [72]:
df2

   ProductID ProductCategory  Price  QuantitySold  Revenue
0        101     Electronics   1500             5     6500
1        102     Electronics   2000             3     6000
2        103       Furniture    500            10     5000
3        104        Clothing     50           100     4000
4        105     Electronics  10000             1    10000
5        106        Clothing     20           200      400
6        107       Furniture   1000             5     5000

In [73]:
df2['Revenue'] = df2['Price'] * df2['QuantitySold']

In [74]:
df2

   ProductID ProductCategory  Price  QuantitySold  Revenue
0        101     Electronics   1500             5     7500
1        102     Electronics   2000             3     6000
2        103       Furniture    500            10     5000
3        104        Clothing     50           100     5000
4        105     Electronics  10000             1    10000
5        106        Clothing     20           200     4000
6        107       Furniture   1000             5     5000

In [76]:
Q1 = df2['Price'].quantile(0.25)
Q3 = df2['Price'].quantile(0.75)        # these are Q1 and Q3 i.e 25 and 75 percentile of data

In [77]:
iqr = Q3 - Q1  # this is inter quartile range 75 - 25

In [80]:


lower_bound = Q1 - 1.5 * iqr
upper_bound = Q3 + 1.5 * iqr

In [85]:
df_filtered = df2[(df2['Price'] >= lower_bound) & (df2['Price'] <= upper_bound)]

In [86]:
print(df_filtered)

   ProductID ProductCategory  Price  QuantitySold  Revenue
0        101     Electronics   1500             5     7500
1        102     Electronics   2000             3     6000
2        103       Furniture    500            10     5000
3        104        Clothing     50           100     5000
5        106        Clothing     20           200     4000
6        107       Furniture   1000             5     5000

In [89]:
df['Price_normalized'] = (df2['Price'] - df2['Price'].min()) / (df2['Price'].max() - df2['Price'].min())
df['Revenue_normalized'] = (df2['Revenue'] - df2['Revenue'].min()) / (df2['Revenue'].max() - df2['Revenue'].min())   # formula = x - x(min) / x(max) - x(mean)

In [90]:
df

,StudentID,Name,Gender,Age,MathScore,EnglishScore,TotalScore,Price_normalized,Revenue_normalized
0,1,Alice,0,15,85.0,90.0,175.0,0.148297,0.583333
1,2,Bob,1,16,82.5,95.0,177.5,0.198397,0.333333
2,3,Charlie,1,15,80.0,85.0,165.0,0.048096,0.166667
3,4,Diana,0,16,90.0,85.0,175.0,0.003006,0.166667
4,5,Eve,0,15,75.0,70.0,145.0,1.000000,1.000000